print("Диаграмма
цветовых
кодов
RGB
Средство
выбора
цвета
RGB | Диаграмма
цветовых
кодов
RGB | Цветовое
пространство
RGB | Формат
и
расчет
цвета
RGB | Таблица
цветов
RGB

Средство
выбора
цвета
RGB

R
128
G
1150
B
150
H
122
°
S
89
%
V
100
%
#
800096
Диаграмма
цветовых
кодов
RGB
Наведите
курсор
на
цвет, чтобы
получить
приведенные
ниже
шестнадцатеричные
и
десятичные
цветовые
коды:

Hex:  #
00
CC66

Red:
0

Green:
204

Blue:
102

Цветовое
пространство
RGB
Цветовое
пространство
RGB
или
цветовая
система
RGB, создает
все
цвета
из
комбинации
цветов
Red, Green
и
Blue.

Красный, зеленый
и
синий
используют
по
8
бит
каждый, которые
имеют
целочисленные
значения
от
0
до
255.
Это
дает
256 * 256 * 256 = 16777216
возможных
цветов.

RGB ≡ Красный, Зеленый, синий

Каждый
пиксель
светодиодного
монитора
отображает
цвета
таким
образом, с
помощью
комбинации
красных, зеленых
и
синих
светодиодов(светоизлучающих
диодов).

Когда
для
красного
пикселя
установлено
значение
0, светодиод
выключается.Когда
для
красного
пикселя
установлено
значение
255, светодиод
включается
полностью.

Любое
значение
между
ними
переводит
светодиод
в
режим
частичного
излучения
света.

Формат
и
расчет
цвета
RGB
Код
RGB
имеет
формат
24
бита(биты
0.
.23):

КРАСНЫЙ[7:0]
ЗЕЛЕНЫЙ[7:0]
СИНИЙ[7:0]
23
16
15
8
7
0
RGB = (R * 65536) + (G * 256) + B, (когда R красный, G зеленый и B СИНИЙ)

Примеры
расчета
Белый
цвет
RGB
Белый
код
RGB = 255 * 65536 + 255 * 256 + 255 =  # FFFFFF

Синий
цвет
RGB
Синий
код
RGB = 0 * 65536 + 0 * 256 + 255 =  # 0000FF

Красный
цвет
RGB
Красный
код
RGB = 255 * 65536 + 0 * 256 + 0 =  # FF0000

Зеленый
Цвет
RGB
Зеленый
код
RGB = 0 * 65536 + 255 * 256 + 0 =  # 00FF00

Серый
цвет
RGB
Серый
код
RGB = 128 * 65536 + 128 * 256 + 128 =  # 808080

Желтый
цвет
RGB
Желтый
код
RGB = 255 * 65536 + 255 * 256 + 0 =  # FFFF00

Таблица
цветов
RGB
Основные
цвета:

Цвет
Название
HTML / CSS
Шестнадцатеричный
код
# RRGGBB

Десятичный
код
(R, G, B)

Черный  # 000000	(0,0,0)
Белый  # FFFFFF	(255,255,255)
Красный  # FF0000	(255,0,0)
Лайм  # 00FF00	(0,255,0)
Синий  # 0000FF	(0,0,255)
Желтый  # FFFF00	(255,255,0)
Голубой / Aqua  # 00FFFF	(0,255,255)
Пурпурный / Фуксия  # FF00FF	(255,0,255)
Серебристый  # C0C0C0	(192,192,192)
Серый  # 808080	(128,128,128)
Темно - бордовый  # 800000	(128,0,0)
Оливковый  # 808000	(128,128,0)
Зеленый  # 008000	(0,128,0)
Фиолетовый  # 800080	(128,0,128)
Бирюзовый  # 008080	(0,128,128)
Темно - синий  # 000080	(0,0,128)

Цвет
Название
цвета
Шестнадцатеричный
код
# RRGGBB

Десятичный
код
R, G, B

темно - бордовый  # 800000	(128,0,0)
темно - красный  # 8B0000	(139,0,0)
Коричневый  # A52A2A	(165,42,42)
огнеупорный
кирпич  # B22222	(178,34,34)
малиновый  # DC143C	(220,20,60)
красный  # FF0000	(255,0,0)
помидор  # FF6347	(255,99,71)
коралловый  # FF7F50	(255,127,80)
индийский
красный  # CD5C5C	(205,92,92)
светло - коралловый  # F08080	(240,128,128)
темно - лососевый  # E9967A	(233,150,122)
лосось  # FA8072	(250,128,114)
светло - лососевый  # FFA07A	(255,160,122)
оранжево - красный  # FF4500	(255,69,0)
темно - оранжевый  # FF8C00	(255,140,0)
Оранжевый  # FFA500	(255,165,0)
Золото  # FFD700	(255,215,0)
темно - золотой
стержень  # B8860B	(184,134,11)
золотой
стержень  # DAA520	(218,165,32)
бледно - золотистый
стержень  # EEE8AA	(238,232,170)
темный
хаки  # BDB76B	(189,183,107)
цвет
хаки  # F0E68C	(240,230,140)
оливковый  # 808000	(128,128,0)
Желтый  # FFFF00	(255,255,0)
желто - зеленый  # 9ACD32	(154,205,50)
темно - оливково - зеленый  # 556B2F	(85,107,47)
оливково - серый  # 6B8E23	(107,142,35)
зеленый
газон  # 7CFC00	(124,252,0)
шартрез  # 7FFF00	(127,255,0)
зеленый
желтый  # ADFF2F	(173,255,47)
темно - зеленый  # 006400	(0,100,0)
Зеленый  # 008000	(0,128,0)
зеленый
цвет
леса  # 228B22	(34,139,34)
лайм  # 00FF00	(0,255,0)
лаймово - зеленый  # 32CD32	(50,205,50)
светло - зеленый  # 90EE90	(144,238,144)
бледно - зеленый  # 98FB98	(152,251,152)
темно - зеленый
цвета
морской
волны  # 8FBC8F	(143,188,143)
средний
весенний
зеленый  # 00FA9A	(0,250,154)
весенне - зеленый  # 00FF7F	(0,255,127)
цвет
морской
волны  # 2E8B57	(46,139,87)
средний
цвет
морской
волны  # 66CDAA	(102,205,170)
средний
цвет
морской
волны  # 3CB371	(60,179,113)
светло - зеленый
цвета
морской
волны  # 20B2AA	(32,178,170)
темно - сланцево - серый  # 2F4F4F	(47,79,79)
бирюзовый  # 008080	(0,128,128)
темно - голубой  # 008B8B	(0,139,139)
aqua  # 00FFFF	(0,255,255)
голубой  # 00FFFF	(0,255,255)
светло - голубой  # E0FFFF	(224,255,255)
темно - бирюзовый  # 00CED1	(0,206,209)
бирюзовый  # 40E0D0	(64,224,208)
средний
бирюзовый  # 48D1CC	(72,209,204)
бледно - бирюзовый  # AFEEEE	(175,238,238)
aqua
marine  # 7FFFD4	(127,255,212)
пудрово - синий  # B0E0E6	(176,224,230)
кадетский
синий  # 5F9EA0	(95,158,160)
стальной
синий  # 4682B4	(70,130,180)
цветок
кукурузы
синий  # 6495ED	(100,149,237)
глубокий
небесно - голубой  # 00BFFF	(0,191,255)
dodger
blue  # 1E90FF	(30,144,255)
светло - синий  # ADD8E6	(173,216,230)
небесно - голубой  # 87CEEB	(135,206,235)
светло - небесно - голубой  # 87CEFA	(135,206,250)
темно - синий  # 191970	(25,25,112)
темно - синий  # 000080	(0,0,128)
темно - синий  # 00008B	(0,0,139)
средний
синий  # 0000CD	(0,0,205)
Синий  # 0000FF	(0,0,255)
королевский
синий  # 4169E1	(65,105,225)
синий
фиолетовый  # 8A2BE2	(138,43,226)
индиго  # 4B0082	(75,0,130)
темно - синий  # 483D8B	(72,61,139)
шиферно - синий  # 6A5ACD	(106,90,205)
средний
сланцево - синий  # 7B68EE	(123,104,238)
средний
фиолетовый  # 9370DB	(147,112,219)
темно - пурпурный  # 8B008B	(139,0,139)
темно - фиолетовый  # 9400D3	(148,0,211)
темная
орхидея  # 9932CC	(153,50,204)
средняя
орхидея  # BA55D3	(186,85,211)
Фиолетовый  # 800080	(128,0,128)
чертополох  # D8BFD8	(216,191,216)
сливовый  # DDA0DD	(221,160,221)
фиолетовый  # EE82EE	(238,130,238)
пурпурный / фуксия  # FF00FF	(255,0,255)
орхидея  # DA70D6	(218,112,214)
средний
фиолетово - красный  # C71585	(199,21,133)
бледно - фиолетово - красный  # DB7093	(219,112,147)
темно - розовый  # FF1493	(255,20,147)
ярко - розовый  # FF69B4	(255,105,180)
светло - розовый  # FFB6C1	(255,182,193)
Розовый  # FFC0CB	(255,192,203)
античный
белый  # FAEBD7	(250,235,215)
бежевый  # F5F5DC	(245,245,220)
суп - пюре  # FFE4C4	(255,228,196)
бланшированный
миндаль  # FFEBCD	(255,235,205)
пшеница  # F5DEB3	(245,222,179)
кукурузный
шелк  # FFF8DC	(255,248,220)
лимонный
шифон  # FFFACD	(255,250,205)
светло - золотистый
стержень
желтого
цвета  # FAFAD2	(250,250,210)
светло - желтый  # FFFFE0	(255,255,224)
седловидно - коричневый  # 8B4513	(139,69,19)
сиенна  # A0522D	(160,82,45)
шоколад  # D2691E	(210,105,30)
Перу  # CD853F	(205,133,63)
песочно - коричневый  # F4A460	(244,164,96)
массивное
дерево  # DEB887	(222,184,135)
загар  # D2B48C	(210,180,140)
розово - коричневый  # BC8F8F	(188,143,143)
мокасины  # FFE4B5	(255,228,181)
белый
цвет
навахо  # FFDEAD	(255,222,173)
персиковая
слойка  # FFDAB9	(255,218,185)
туманная
роза  # FFE4E1	(255,228,225)
лавандовые
румяна  # FFF0F5	(255,240,245)
белье  # FAF0E6	(250,240,230)
старое
кружево  # FDF5E6	(253,245,230)
пломбир
из
папайи  # FFEFD5	(255,239,213)
морская
раковина  # FFF5EE	(255,245,238)
мятный
крем  # F5FFFA	(245,255,250)
сланцево - серый  # 708090	(112,128,144)
светло - сланцево - серый  # 778899	(119,136,153)
светло - стальной
синий  # B0C4DE	(176,196,222)
лавандовый  # E6E6FA	(230,230,250)
цветочный
белый  # FFFAF0	(255,250,240)
алиса
блю  # F0F8FF	(240,248,255)
призрачный
белый  # F8F8FF	(248,248,255)
медовая
роса  # F0FFF0	(240,255,240)
слоновая
кость  # FFFFF0	(255,255,240)
лазурный  # F0FFFF	(240,255,255)
снег  # FFFAFA	(255,250,250)
Черный  # 000000	(0,0,0)
тускло - серый / dim
grey  # 696969	(105,105,105)
серый / grey  # 808080	(128,128,128)
темно - серый / dark
grey  # A9A9A9	(169,169,169)
серебристый  # C0C0C0	(192,192,192)
светло - серый / light
grey  # D3D3D3	(211,211,211)
гейнсборо  # DCDCDC	(220,220,220)
белый
дым  # F5F5F5	(245,245,245)
Белый  # FFFFFF	(255,255,255)
")